<template>
  <div id="confidentiality" v-scroll="handleScroll">
    <div class="confidentiality-gradient_top"></div>
    <div class="confidentiality-gradient_bottom"></div>
    <Header :color="color" />

    <div class="container">
      <h2 class="confid-header">Политика конфиденциальности</h2>

      <div class="confid-information">
        <p>
          Политика конфиденциальности и защиты информации. Оставляя данные на
          сайте, Вы соглашаетесь с Политикой конфиденциальности и защиты
          информации.
        </p>

        <p><span>Защита данных</span></p>

        <p>
          Администрация сайта instago.link (далее Сайт) не может передать или
          раскрыть информацию, предоставленную пользователем (далее
          Пользователь) при регистрации и использовании функций сайта третьим
          лицам, кроме случаев, описанных законодательством страны, на
          территории которой пользователь ведет свою деятельность.
        </p>
      </div>

      <div class="confid-information_block">
        <h3>1. Общие условия</h3>

        <p>
          1.1. Настоящая Политика определяет порядок обработки и защиты
          администрации сайта instago.link (далее Сайт) информации о физических
          лицах, которая может быть получена Сайтом при использовании
          Пользователем услуг предоставляемых посредством сайта, сервисов,
          служб.
        </p>
        <p>
          1.2. Целью настоящей Политики является обеспечение надлежащей защиты
          информации о Пользователях, в том числе их персональных данных, от
          несанкционированного доступа и разглашения.
        </p>
        <p>
          1.3. Отношения, связанные со сбором, хранением, распространением и
          защитой информации предоставляемой Пользователем, регулируются
          настоящей Политикой и действующим законодательством Российской
          Федерации.
        </p>
        <p>
          1.4. Регистрируясь на Сайте или используя Сайт и Сервисы, Пользователь
          выражает свое полное согласие с условиями настоящей Политики.
        </p>
        <p>
          1.5. В случае несогласия Пользователя с условиями настоящей Политики
          использование Сайта и/или каких-либо Сервисов доступных при
          использовании Сайта должно быть немедленно прекращено.
        </p>
      </div>

      <div class="confid-information_block">
        <h3>2. Цели сбора, обработки и хранения информации предоставляемой
            пользователями </h3>

        <p>
          2.1. Обработка персональных данных Пользователя осуществляется в
          соответствии с законодательством Российской Федерации. Сайт
          обрабатывает персональные данные Пользователя в целях: Идентификации
          стороны в рамках соглашений;
        </p>
        <p>
          Проверки, исследования и анализа таких данных, позволяющих
          поддерживать и улучшать сервисы и разделы Сайта, а также разрабатывать
          новые сервисы и разделы Сайта. - проведение статистических и иных
          исследований на основе обезличенных данных.
        </p>
        <p>
          Предоставления Пользователю эффективной технической поддержки при
          возникновении проблем, связанных с использованием сайта.
        </p>
        <p>
          Информирования Пользователей об услугах, целевом маркетинге,
          обновлении услуг и рекламных предложениях на основании информационных
          предпочтений Пользователей. Таргетирование рекламных материалов
          Разрешать пользователям отказаться от подписки, используя ссылку внизу
          каждого письма Если в любое время вы хотели бы отказаться от получения
          дальнейших сообщений электронной почты, вы можете следовать инструкции
          в нижней части каждого письма, и мы незамедлительно удалим вас из всех
          видов корреспонденции. Улучшение качества услуг, удобства их
          использования, разработка и развитие Сайта, устранения технических
          неполадок или проблем с безопасностью. Анализ для расширения и
          совершенствования услуг, информационного наполнения и рекламы услуг;
        </p>
      </div>

      <div class="confid-information_block">
        <h3>3. Условия обработки персональной информации предоставленной
            пользователем и ее передачи третьим лицам</h3>

        <p>
          3.1. Сайт принимает все необходимые меры для защиты персональных
          данных Пользователя от неправомерного доступа, изменения, раскрытия
          или уничтожения.
        </p>
        <p>
          3.2. Сайт предоставляет доступ к персональным данным Пользователя
          только тем работникам, подрядчикам и аффилированным лицам которым эта
          информация необходима для обеспечения функционирования Сайта, Сервисов
          и оказания Услуг Пользователю.
        </p>
        <p>
          3.3. Сайт вправе использовать предоставленную Пользователем
          информацию, в том числе персональные данные, в целях обеспечения
          соблюдения требований действующего законодательства Российской
          Федерации (в том числе в целях предупреждения и/или пресечения
          незаконных и/или противоправных действий Пользователей). Раскрытие
          предоставленной Пользователем информации может быть произведено лишь в
          соответствии с действующим законодательством Российской Федерации по
          требованию суда, правоохранительных органов, а равно в иных
          предусмотренных законодательством Российской Федерации случаях.
        </p>
      </div>

      <div class="confid-information_block">
        <h3>4. Изменение политики конфиденциальности. Применимое
            законодательство</h3>

        <p>
          4.1. Сайт имеет право вносить изменения в настоящую Политику
          конфиденциальности. При внесении изменений в актуальной редакции
          указывается дата последнего обновления. Новая редакция Политики
          вступает в силу с момента ее размещения, если иное не предусмотрено
          новой редакцией Политики. Действующая редакция всегда находится на
          главной странице сайта .
        </p>
        <p>
          4.2. К настоящей Политике и отношениям между Пользователем и сайтом
          возникающим в связи с применением Политики конфиденциальности,
          подлежит применению право Российской Федерации.
        </p>
      </div>

      <div class="confid-information_block">
        <h3>5. Обратная связь. Вопросы и предложения</h3>

        <p>
          5.1. Все предложения или вопросы по поводу настоящей Политики следует
          сообщать в Службу поддержки.
        </p>
      </div>
    </div>
  </div>
</template>

<script>
import Vue from "vue"
import Header from '../LandingPage/header/Header.vue'

Vue.directive('scroll', {
  inserted: function (el, binding) {
    let f = function (evt) {
      if (binding.value(evt, el)) {
        window.removeEventListener('scroll', f)
      }
    }
    window.addEventListener('scroll', f)
  }
})

export default {
  name: 'HomePage',
  components: {
    Header,
  },
  data() {
    return {
      color: 'transparent',
      scrollTop: 0,
    }
  },
  methods: {
    handleScroll: function (evt, el) {
      this.color = window.scrollY > 50 ? "#3B3C72" : "transparent"
      return window.scrollY > 10000
    }
  },
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="sass" scoped src="./Confidentiality.sass"></style>
