<template>
  <div id="offer" v-scroll="handleScroll">
    <div class="offer-gradient_top"></div>
    <div class="offer-gradient_bottom"></div>

    <Header :color="color" />

    <div class="container">
      <h2 class="offer-header">Публичная оферта</h2>

      <div class="offer-information">
        <p>
          Настоящее предложение является публичной офертой (именуемой в
          дальнейшем «Договор») web-сайта instago.link (именуемого в дальнейшем
          «Исполнитель») и адресовано любому лицу, заинтересованному в получении
          услуг, предоставляемых Исполнителем.
        </p>

        <p>
          Безусловным принятием (акцептом) условий настоящего Договора считается
          регистрация на web-сайте instago.link. Акцепт настоящего Договора на
          иных условиях, отличных от тех, что указаны в настоящем Договоре, либо
          акцепт под условием, не допускается.
        </p>

        <p>
          Лицо, прошедшее процедуру регистрации на web-сайте instago.link
          именуется в дальнейшем «Пользователь», а Исполнитель и Пользователь
          совместно именуются «Стороны».
        </p>
      </div>

      <div class="offer-information_block">
        <h3>1. Термины и понятия</h3>

        <p>
          1.1. Нижеприведенные понятия и термины, указанные в настоящем пункте,
          используются в тексте настоящего Договора в следующем значении:
        </p>
        <p>
          1.1.1. Web-сайт – совокупность электронных документов (файлов)
          частного лица или организации в компьютерной сети, объединённых под
          одним адресом (доменным именем или IP-адресом);
        </p>
        <p>
          1.1.2. Личный кабинет - персональная часть Сервиса, недоступная для
          всеобщего обозрения, доступ к которой осуществляется Пользователем
          путем ввода личных идентификационных данных;
        </p>
        <p>
          1.1.3. Сервис – совокупность программных кодов web-сайта instago.link,
          скриптов устанавливаемых на web-сайты Пользователей, а также иных
          программных средств, предназначенных для осуществления автоматизации
          продвижения в Инстаграм;
        </p>
      </div>

      <div class="offer-information_block">
        <h3>2. Предмет договора</h3>

        <p>
          2.1. Исполнитель предоставляет Пользователю услуги доступа к Сервису,
          а Пользователь принимает и оплачивает оказанные услуги на условиях
          настоящего Договора.
        </p>
        <p>
          2.2. Конкретный перечень услуг, предоставляемых Исполнителем с
          использованием Сервиса, определяется тарифным планом выбранным
          Пользователем.
        </p>
      </div>

      <div class="offer-information_block">
        <h3>3. Порядок оказания и приемки услуг</h3>

        <p>
          3.1. Исполнителем оказываются услуги в формате «КАК ЕСТЬ». Технические
          перебои и временные приостановки оказания услуг (в т.ч. связанные с
          проведением технологических и профилактических работ на Сервисе) не
          являются основанием для предъявления к Исполнителю каких-либо
          моральных, материальных, имущественных или иных претензий.
        </p>
      </div>

      <div class="offer-information_block">
        <h3>4. Стоимость услуг и порядок расчетов</h3>

        <p>
          4.1. Стоимость услуг по использованию Сервиса определяется тарифным
          планом выбранным Пользователем и опубликованном на web-сайте
          instago.link.
        </p>
        <p>
          4.2. Исполнитель вправе в любое время изменять цену услуг путем
          опубликования новых цен на web-сайте instago.link.
        </p>
        <p>
          4.3. В случае расторжения Договора остатки денежных средств на лицевом
          счете Пользователя не возвращаются.
        </p>
      </div>

      <div class="offer-information_block">
        <h3>5. Права Пользователя</h3>

        <p>
          5.1. Лицо, прошедшее процедуру регистрации на Сервисе, подтверждает
          свою дееспособность по законодательству страны своей резиденции. Все
          последствия неисполнения данного условия возлагаются на самого
          Пользователя.
        </p>
        <p>
          5.2. Пользователь обязуется не предпринимать действий, направленных на
          нарушения работы Сервиса.
        </p>
        <p>
          5.3. Пользователь обязуется не использовать Сервис для продажи
          (распространения) товаров (выполнения работ, оказания услуг,
          распространения информации и иных действий) если такие действия
          противоречат законодательству России и (или) страны резиденции
          Пользователя.
        </p>
        <p>
          5.4. Пользователь признает, что Исполнитель не несет ответственности
          за какой-либо ущерб, каким-либо образом имеющий отношение к
          использованию или невозможности использования Сервиса.
        </p>
      </div>

      <div class="offer-information_block">
        <h3>6. Права Исполнителя</h3>

        <p>
          6.1. Исполнитель имеет право оказывать услуги Пользователям на
          условиях настоящего договора.
        </p>
        <p>
          6.2. Исполнитель имеет право отказать любому Пользователю в оказании
          Услуги и блокировать доступ к Учетной записи Пользователя в случаях:
        </p>
        <p>6.2.1. Если действия Пользователя нарушают настоящий договор;</p>
        <p>6.2.2. Если возникли технические неисправности у Исполнителя;</p>
        <p>6.2.3. По собственному усмотрению без объяснения причин;</p>
      </div>

      <div class="offer-information_block">
        <h3>7. Срок действия договора, порядок изменения и расторжения</h3>

        <p>
          7.1. Договор вступает в силу со дня его акцепта Пользователем и
          действует до исполнения Сторонами взятых на себя обязательств.
        </p>
        <p>
          7.2. Исполнитель вправе в любое время по своему усмотрению и без
          предварительного согласования с Пользователем вносить изменения в
          настоящий Договор. Изменения и дополнения вступают в силу с момента их
          опубликования на web-сайте instago.link.
        </p>
        <p>
          7.3. Использование услуг, предусмотренных настоящим Договором, после
          любых изменений настоящего Договора означает безоговорочное согласие с
          такими изменениями и (или) дополнениями.
        </p>
      </div>

      <div class="offer-information_block">
        <h3>8. Обстоятельства непреодолимой силы</h3>

        <p>
          8.1. Стороны освобождаются от ответственности за частичное или полное
          неисполнение обязательств по настоящему договору, если таковые явились
          следствием действия обстоятельств непреодолимой силы, возникших после
          заключения Договора.
        </p>
        <p>
          8.2. Под обстоятельствами непреодолимой силы понимаются военные
          действия любого характера, блокады, забастовки; пожары, наводнения,
          землетрясения, цунами и другие стихийные бедствия; действия органов
          государственной власти и другие аналогичные факторы способные оказать
          влияние на исполнение сторонами обязательств по настоящему Договору.
        </p>
      </div>

      <div class="offer-information_block">
        <h3>9. Прочие условия</h3>

        <p>
          9.1. Взаимоотношения сторон, не урегулированные настоящим Договором,
          регламентируются действующим законодательством России.
        </p>
        <p>
          9.2. В случае возникновения споров по условиям настоящего Договора
          Стороны решают их путем переговоров.
        </p>
        <p>
          9.3. В случае невозможности разрешения споров путем переговоров, они
          подлежат разрешению в судебном порядке в соответствии с
          законодательством России.
        </p>
        <p>
          9.4. В случае, если одно или более положений настоящего Договора
          являются по какой-либо причине недействительными, не имеющими
          юридической силы, такая недействительность не оказывает влияния на
          действительность любого другого положения Договора, и Договор должен
          толковаться таким образом, как если бы он не содержал такого
          недействительного положения.
        </p>
      </div>

      <div class="offer-information_block">
        <h3>10. Техническая и информационная поддержка</h3>

        <p>
          10.1. Исполнитель предоставляет бесплатную техническую и
          информационную поддержку для всех Пользователей.
        </p>
      </div>

      <div class="offer-information_block">
        <h3>11. Реквизиты Исполнителя</h3>
      </div>

      <h4>Электронный адрес: info@instago.link</h4>
    </div>
  </div>
</template>

<script>
import Vue from "vue"
import Header from '../LandingPage/header/Header.vue'

Vue.directive('scroll', {
  inserted: function (el, binding) {
    let f = function (evt) {
      if (binding.value(evt, el)) {
        window.removeEventListener('scroll', f)
      }
    }
    window.addEventListener('scroll', f)
  }
})

export default {
  name: 'PublickOffer',
  components: {
    Header,
  },
  data() {
    return {
      color: 'transparent',
      scrollTop: 0,
    }
  },

  methods: {
    handleScroll: function (evt, el) {
      this.color = window.scrollY > 50 ? "#3B3C72" : "transparent"
      return window.scrollY > 10000
    }
  },
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="sass" scoped src="./PublickOffer.sass"></style>
